tap "1password/tap"
tap "armosec/kubescape"
tap "buo/cask-upgrade"
tap "deggja/netfetch", "https://github.com/deggja/netfetch"
tap "dteoh/sqa"
tap "fairwindsops/tap"
tap "github/gh"
tap "golangci/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "pulumi/tap"
tap "shivammathur/php"
tap "yt-dlp/taps"

# Run your GitHub Actions locally
brew "act"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Freely available high-quality data compressor
brew "bzip2"
# Mozilla CA certificate store
brew "ca-certificates"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# Command-line tool to manage cert-manager
brew "cmctl"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# AV1 decoder targeted to be small and fast
brew "dav1d"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Download assets from a commit, branch, or tag of GitHub repositories
brew "fetch"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Software library to render fonts
brew "freetype"
# Terminal JSON viewer
brew "fx"
# GNU compiler collection
brew "gcc"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU database manager
brew "gdbm"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Core application library for C
brew "glib"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Command-line tool for generating regular expressions
brew "grex"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# OpenType text shaping engine
brew "harfbuzz"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Integer Set Library for the polyhedral model
brew "isl"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Run local Kubernetes cluster in Docker
brew "kind"
# Network authentication protocol
brew "krb5"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# International domain name library
brew "libidn"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# LLVM's OpenMP runtime library
brew "libomp", link: true
# C library implementing the SSH2 protocol
brew "libssh2"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Keep your Mac's application settings in sync
brew "mackup"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# MP3 player for Linux and UNIX
brew "mpg123"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk@17"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Framework for layout and rendering of i18n text
brew "pango"
# General-purpose scripting language
brew "php"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# Python dependency management tool
brew "pipenv"
# Manage compile and link flags for libraries
brew "pkg-config"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Compression/decompression library aiming for high speed
brew "snappy"
# Secure Reliable Transport
brew "srt"
# Cross-shell prompt for astronauts
brew "starship"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# Tool Command Language
brew "tcl-tk"
# User interface to the TELNET protocol
brew "telnet"
# Reads from existing Cloud Providers and generates Terraform code
brew "terracognita"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Tool to build, change, and version infrastructure
brew "terraform"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Kubernetes YAML manifests to Terraform HCL converter
brew "tfk8s"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# Disaster recovery for Kubernetes resources and persistent volumes
brew "velero"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Internet file retriever
brew "wget"
# General-purpose data compression with high compression ratio
brew "xz"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Scaling, colorspace conversion, and dithering library
brew "zimg"
# General-purpose lossless data-compression library
brew "zlib"

# Kubernetes misconfiguration testing
brew "armosec/kubescape/kubescape-cli"
# CLI tool to scan for network policies in Kubernetes clusters/namespaces and provide a score based on the amount of untargeted workloads
brew "deggja/netfetch/netfetch"
# Detect deprecated Kubernetes apiVersions
brew "fairwindsops/tap/pluto"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# Packer
brew "hashicorp/tap/packer"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language
brew "pulumi/tap/pulumi"

# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# AirPods companion app
cask "airbuddy"
# Application uninstaller
cask "appcleaner"
# Server and cloud storage browser
cask "cyberduck"
# Disk space visualizer
cask "daisydisk"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# JetBrainsMono Nerd Font families (JetBrains Mono)
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# GIT client
cask "fork"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# User-friendly cURL replacement (command-line HTTP client)
cask "httpie"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# End-to-end encryption software
cask "keybase"
# Open-source Markdown editor
cask "macdown"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Security software for business
cask "nordlayer"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# VPN client for secure internet access and private browsing
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Modern and intuitive HTTP Debugging Proxy app
cask "proxyman"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# QuickLook plugin for JSON files
cask "quicklook-json"
# Control your tools with a few keystrokes
cask "raycast"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Team communication and collaboration software
cask "slack"
# Add a global delay to Command-Q to stop accidental app quits
cask "slowquitapps"
# Open-source media center
cask "stremio"
# Text editor for code, markup and prose
cask "sublime-text"
# Quicklook extension for source files
cask "syntax-highlight"
# Native GUI tool for relational databases
cask "tableplus"
# Tinker tool for PHP and Laravel developers
cask "tinkerwell"
# Open-source BitTorrent client
cask "transmission"
# File transfer application
cask "transmit"
# VPN client for secure internet access and private browsing
cask "visual-studio-code"
# Desktop client for WhatsApp
cask "whatsapp"
# VPN client for secure internet access and private browsing
cask "windscribe"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"

mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "Boop", id: 1518425043
mas "Dato", id: 1470584107
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "myTuner Radio Pro", id: 808285143
mas "Nautik", id: 1672838783
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Prime Video", id: 545519333
mas "ReadKit - Reading Hub", id: 1615798039
mas "The Unarchiver", id: 425424353

vscode "4ops.packer"
vscode "alefragnani.project-manager"
vscode "annsk.alignment"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "caarlos0.language-prometheus"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "exiasr.hadolint"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.copilot"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql-syntax"
vscode "graphql.vscode-graphql"
vscode "hashicorp.terraform"
vscode "hogashi.crontab-syntax-highlight"
vscode "laravel.vscode-laravel"
vscode "lunuan.kubernetes-templates"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vsliveshare.vsliveshare"
vscode "phplasma.csv-to-table"
vscode "pulumi.pulumi-lsp-client"
vscode "redhat.ansible"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "sharat.vscode-brewfile"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tberman.json-schema-validator"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
