tap "1password/tap"
tap "armosec/kubescape"
tap "buo/cask-upgrade"
tap "cjbassi/gotop"
tap "deggja/netfetch", "https://github.com/deggja/netfetch"
tap "derailed/k9s"
tap "dopplerhq/cli"
tap "dteoh/sqa"
tap "fairwindsops/tap"
tap "github/gh"
tap "golangci/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "hidetatz/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "norwoodj/tap"
tap "pulumi/tap"
tap "shivammathur/php"
tap "yt-dlp/taps"

# Run your GitHub Actions locally 🚀
brew "act"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Automate deployment, configuration, and upgrading
brew "ansible@2.8"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Freely available high-quality data compressor
brew "bzip2"
# Mozilla CA certificate store
brew "ca-certificates"
# Cross-platform make
brew "cmake"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr", link: false
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Command-line tool for DigitalOcean
brew "doctl"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Download assets from a commit, branch, or tag of GitHub repositories
brew "fetch"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Software library to render fonts
brew "freetype"
# Terminal JSON viewer
brew "fx"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Command-line tool for generating regular expressions
brew "grex"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Run local Kubernetes cluster in Docker
brew "kind"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes testing according to Hardening Guidance by NSA and CISA
brew "kubescape", link: false
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# International domain name library
brew "libidn"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# LLVM's OpenMP runtime library
brew "libomp", link: true
# C library implementing the SSH2 protocol
brew "libssh2"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Keep your Mac's application settings in sync
brew "mackup"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# MP3 player for Linux and UNIX
brew "mpg123"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk@17"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# General-purpose scripting language
brew "php"
# Python dependency management tool
brew "pipenv"
# Manage compile and link flags for libraries
brew "pkg-config"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Library for command-line editing
brew "readline"
# Rust toolchain installer
brew "rustup-init"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# User interface to the TELNET protocol
brew "telnet"
# Reads from existing Cloud Providers and generates Terraform code
brew "terracognita"
# Tool to build, change, and version infrastructure
brew "terraform"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Kubernetes YAML manifests to Terraform HCL converter
brew "tfk8s"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Validating, recursive, caching DNS resolver
brew "unbound"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# Additional completion definitions for zsh
brew "zsh-completions"
# UNIX shell (command interpreter)
brew "zsh"

# Kubernetes misconfiguration testing
brew "armosec/kubescape/kubescape-cli"
# A terminal based graphical activity monitor inspired by gtop and vtop
brew "cjbassi/gotop/gotop"
# CLI tool to scan for network policies in Kubernetes clusters/namespaces and provide a score based on the amount of untargeted workloads
brew "deggja/netfetch/netfetch"
# 🐶 Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# The official Doppler CLI for managing your secrets
brew "dopplerhq/cli/doppler"
# Detect deprecated Kubernetes apiVersions
brew "fairwindsops/tap/pluto"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser/tap/goreleaser"
# Packer
brew "hashicorp/tap/packer"
# Colorize your kubectl output
brew "hidetatz/tap/kubecolor"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Automatically generate markdown documentation for helm charts
brew "norwoodj/tap/helm-docs"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language
brew "pulumi/tap/pulumi"

# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Stand alone ad blocker
cask "adguard"
# Chromium based browser
cask "arc"
# Menu bar icon organizer
cask "bartender"
# Server and cloud storage browser
cask "cyberduck"
# Disk space visualizer
cask "daisydisk"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# GIT client
cask "fork"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Kubernetes IDE
cask "lens"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Online collaborative whiteboard platform
cask "miro"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk"
# VPN client for secure internet access and private browsing
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Modern and intuitive HTTP Debugging Proxy app
cask "proxyman"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# QuickLook plugin for JSON files
cask "quicklook-json"
# Control your tools with a few keystrokes
cask "raycast"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Add a global delay to Command-Q to stop accidental app quits
cask "slowquitapps"
# Open-source media center
cask "stremio"
# Text editor for code, markup and prose
cask "sublime-text"
# Quicklook extension for source files
cask "syntax-highlight"
# Native GUI tool for relational databases
cask "tableplus"
# Messaging app with a focus on speed and security
cask "telegram"
# Customizable email client
cask "transmission"
# File transfer application
cask "transmit"
# VPN client for secure internet access and private browsing
cask "visual-studio-code"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"

mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "Boop", id: 1518425043
mas "Dato", id: 1470584107
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "myTuner Radio Pro", id: 808285143
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Prime Video", id: 545519333
mas "The Unarchiver", id: 425424353
mas "Today", id: 6443714928
mas "Twitter", id: 1482454543

vscode "4ops.packer"
vscode "alefragnani.project-manager"
vscode "annsk.alignment"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "caarlos0.language-prometheus"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "exiasr.hadolint"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hogashi.crontab-syntax-highlight"
vscode "lunuan.kubernetes-templates"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vsliveshare.vsliveshare"
vscode "phplasma.csv-to-table"
vscode "pulumi.pulumi-lsp-client"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "sharat.vscode-brewfile"
vscode "tamasfe.even-better-toml"
vscode "tberman.json-schema-validator"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "vtrois.gitmoji-vscode"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
