tap "1password/tap"
tap "anomalyco/tap"
tap "armosec/kubescape"
tap "aws/tap"
tap "buo/cask-upgrade"
tap "dailybothq/tap"
tap "darksworm/tap"
tap "deggja/netfetch", "https://github.com/deggja/netfetch"
tap "dunglas/frankenphp"
tap "fairwindsops/tap"
tap "github/gh"
tap "golangci/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
tap "kyosenergy/tap"
tap "minamijoyo/hcledit"
tap "oven-sh/bun"
tap "pulumi/tap"
tap "robusta-dev/holmesgpt"
tap "shivammathur/php"
tap "teamookla/speedtest"
tap "threatcl/repo"
tap "yt-dlp/taps"

# Run your GitHub Actions locally
brew "act"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Shell history sync and search
brew "atuin"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Freely available high-quality data compressor
brew "bzip2"
# Mozilla CA certificate store
brew "ca-certificates"
# Vector graphics library with cross-device output support
brew "cairo"
# Prevent cloud misconfigurations during build-time for IaC tools
brew "checkov"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Command-line tool to manage cert-manager
brew "cmctl"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool for interacting with remote images and registries
brew "crane"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# AV1 decoder targeted to be small and fast
brew "dav1d"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Command-line tool for DigitalOcean
brew "doctl"
# CLI for interacting with Doppler secrets and configuration
brew "doppler"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Download assets from a commit, branch, or tag of GitHub repositories
brew "fetch"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Software library to render fonts
brew "freetype"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Graphics library to dynamically manipulate images
brew "gd"
# GNU database manager
brew "gdbm"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Core application library for C
brew "glib"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Terminal based graphical activity monitor inspired by gtop
brew "gotop"
# Command-line tool for generating regular expressions
brew "grex"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# OpenType text shaping engine
brew "harfbuzz"
# The Kubernetes Package Manager
brew "helm"
# Tool for automatically generating markdown documentation for helm charts
brew "helm-docs"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@77"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Cost estimates for Terraform
brew "infracost"
# Integer Set Library for the polyhedral model
brew "isl"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Network authentication protocol
brew "krb5"
# Package manager for kubectl plugins
brew "krew"
# Colorize your kubectl output
brew "kubecolor"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Kubernetes command-line interface
brew "kubectl"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Simple terminal UI for git commands
brew "lazygit"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# International domain name library
brew "libidn"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# LLVM's OpenMP runtime library
brew "libomp", link: true
# C library implementing the SSH2 protocol
brew "libssh2"
# YAML Parser
brew "libyaml"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Run LogQL queries against a Loki server
brew "logcli"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Keep your Mac's application settings in sync
brew "mackup"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# MP3 player for Linux and UNIX
brew "mpg123"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk@17"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Framework for layout and rendering of i18n text
brew "pango"
# General-purpose scripting language
brew "php"
# PHP internationalization extension
brew "php-intl"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# Python dependency management tool
brew "pipenv"
# Manage compile and link flags for libraries
brew "pkg-config"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Python package management tool
brew "poetry"
# .NET Core
brew "powershell"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Compression/decompression library aiming for high speed
brew "snappy"
# Secure Reliable Transport
brew "srt"
# Cross-shell prompt for astronauts
brew "starship"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# Tool Command Language
brew "tcl-tk"
# User interface to the TELNET protocol
brew "telnet"
# Reads from existing Cloud Providers and generates Terraform code
brew "terracognita"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Kubernetes YAML manifests to Terraform HCL converter
brew "tfk8s"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# Disaster recovery for Kubernetes resources and persistent volumes
brew "velero"
# Modern watch command
brew "viddy"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Command-line interface for the WakaTime api
brew "wakatime-cli"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Internet file retriever
brew "wget"
# General-purpose data compression with high compression ratio
brew "xz"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Scaling, colorspace conversion, and dithering library
brew "zimg"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"

# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Kubernetes misconfiguration testing
brew "armosec/kubescape/kubescape-cli"
# eks-node-viewer is a tool for visualizing dynamic node usage within an EKS cluster.
brew "aws/tap/eks-node-viewer"
# dailybot command line tool
brew "dailybothq/tap/dailybot"
# A GitOps CLI tool for managing ArgoCD applications
cask "darksworm/tap/argonaut"
# Messaging app with a focus on speed and security
cask "telegram"
# CLI tool to scan for network policies in Kubernetes clusters/namespaces and provide a score based on the amount of untargeted workloads
brew "deggja/netfetch/netfetch"
# Modern PHP app server
brew "dunglas/frankenphp/frankenphp"
# Detect deprecated Kubernetes apiVersions
brew "fairwindsops/tap/pluto"
# Fast linters runner for Go.
brew "golangci/tap/golangci-lint"
# Packer
brew "hashicorp/tap/packer"
# Terraform
brew "hashicorp/tap/terraform"
# Automatically gets credentials for Amazon ECR on docker push/docker pull with support for AWS SSO
brew "kyosenergy/tap/docker-credential-sso-ecr-login"
# A command line editor for HCL
brew "minamijoyo/hcledit/hcledit"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Pulumi - Modern Infrastructure as Code. Any cloud, any language
brew "pulumi/tap/pulumi"
# Robusta HolmesGPT CLI
brew "robusta-dev/holmesgpt/holmesgpt"
# Team Ookla speedtest CLI
brew "teamookla/speedtest/speedtest"
# Documenting your Threat Models with HCL
brew "threatcl/repo/threatcl"

# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# AirPods companion app
cask "airbuddy"
# Application uninstaller
cask "appcleaner"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# Server and cloud storage browser
cask "cyberduck"
# Disk space visualizer
cask "daisydisk"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker-desktop"
# App to build and share containerized applications and microservices
cask "docker"
# JetBrainsMono Nerd Font families (JetBrains Mono)
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Kubernetes IDE
cask "freelens"
# GIT client
cask "fork"
# Speech to text application
cask "handy"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Desktop automation application
cask "hammerspoon"
# User-friendly cURL replacement (command-line HTTP client)
cask "httpie-desktop"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# End-to-end encryption software
cask "keybase"
# App to manage software development and track bugs
cask "linear-linear"
# Markdown editor with live preview and syntax highlighting
cask "macdown-3000"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Security software for business
cask "nordlayer"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# VPN client for secure internet access and private browsing
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Modern and intuitive HTTP Debugging Proxy app
cask "proxyman"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# Thumbnails, static previews, cover art and metadata for video files
cask "quicklook-video"
# QuickLook plugin for JSON files
cask "quicklook-json"
# Control your tools with a few keystrokes
cask "raycast"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Team communication and collaboration software
cask "slack"
# Open-source media center
cask "stremio"
# Text editor for code, markup and prose
cask "sublime-text"
# Quicklook extension for source files
cask "syntax-highlight"
# Native GUI tool for relational databases
cask "tableplus"
# Tinker tool for PHP and Laravel developers
cask "tinkerwell"
# Open-source BitTorrent client
cask "transmission"
# File transfer application
cask "transmit"
# VPN client for secure internet access and private browsing
cask "visual-studio-code"
# Desktop client for WhatsApp
cask "whatsapp"
# Live wallpaper app
cask "wallspace"
# VPN client for secure internet access and private browsing
cask "windscribe"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"

mas "1Password for Safari", id: 1569813296
mas "Bear", id: 1091189122
mas "Boop", id: 1518425043
mas "Budget Flow", id: 1640091876
mas "Dato", id: 1470584107
mas "Keynote", id: 409183694
mas "Messenger", id: 1480068668
mas "myTuner Radio Pro", id: 808285143
mas "Nautik", id: 1672838783
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Prime Video", id: 545519333
mas "ReadKit", id: 1615798039
mas "Say No to Notch", id: 1639306886
mas "The Unarchiver", id: 425424353
mas "Windows App", id: 1295203466

vscode "4ops.packer"
vscode "adpyke.vscode-sql-formatter"
vscode "alefragnani.project-manager"
vscode "annsk.alignment"
vscode "betajob.modulestf"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "caarlos0.language-prometheus"
vscode "continue.continue"
vscode "dannysteenman.iam-actions-snippets"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "exiasr.hadolint"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "mechatroner.rainbow-csv"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "hogashi.crontab-syntax-highlight"
vscode "laravel.vscode-laravel"
vscode "lunuan.kubernetes-templates"
vscode "mathworks.language-matlab"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vsliveshare.vsliveshare"
vscode "openai.chatgpt"
vscode "phplasma.csv-to-table"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "saoudrizwan.claude-dev"
vscode "sharat.vscode-brewfile"
vscode "sst-dev.opencode"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tberman.json-schema-validator"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"

go "github.com/awslabs/amazon-ecr-credential-helper/ecr-login/cli/docker-credential-ecr-login"
go "golang.org/x/tools/gopls"
go "github.com/kyosenergy/sso-ecr-login"
go "honnef.co/go/tools/cmd/staticcheck"
